Code/CalendarParse/gradingPart1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Parsing Calendar Data Part 1: Grading Guide</title>
<!-- 2015-03-18 Wed 13:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />


</head>
<body>
<div id="content">
<h1 class="title">Parsing Calendar Data Part 1: Grading Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Grading</a>
<ul>
<li><a href="#sec-1-1">1.1. Breaking up the code</a></li>
<li><a href="#sec-1-2">1.2. Solving the combinatorial explosion</a></li>
<li><a href="#sec-1-3">1.3. Adding tests</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Example Feedback</a></li>
<li><a href="#sec-3">3. FAQ</a>
<ul>
<li><a href="#sec-3-1">3.1. What if they have no tests?</a></li>
<li><a href="#sec-3-2">3.2. What if they broke up the code but everything is still in 1 file?</a></li>
<li><a href="#sec-3-3">3.3. What if the code no longer works?</a></li>
<li><a href="#sec-3-4">3.4. Where should feedback be placed?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Grading</h2>
<div class="outline-text-2" id="text-1">
<p>
The main instruction for this assignment was to refactor this code to
your satisfaction.  So in general if folks put in an effort I'm
inclined to give them full marks.  However, I want to provide detailed
feedback on a few key areas.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Breaking up the code</h3>
<div class="outline-text-3" id="text-1-1">
<p>
One way or another the long function should be broken up into
functions and classes.  If they didn't do this at least, I don't think
I'd give them credit.  But good to acknowledge in the feedback
nonetheless.
</p>

<p>
Extra love if they factored in a way that removed the duplication
between the two XML parses.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Solving the combinatorial explosion</h3>
<div class="outline-text-3" id="text-1-2">
<p>
So this is probably most important.  As currently structured, the code
requires x times y functions, where x is the number of parsers and y
is the number of commands (i.e. a unique implementation of each
command for each file type).  This is super bad - and even a design
that adds new classes can still have this problem.
</p>

<p>
The easiest way to solve this is to have an intermediate type -
something like a Calendar Event (representing one particular event in
the calendar).  Then you have type specific parsers that produce these
events, and all the commands operate on events rather than the unique
file types themselves.
</p>

<p>
Anyway, if the student hasn't solved this problem they should
definitely get feedback on it.  If they have solved it congratulate
them.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Adding tests</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Refactoring requires tests and this code is hard to test.  If the
student doesn't have tests you should comment on it - if they do you
should give them congratulations.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Example Feedback</h2>
<div class="outline-text-2" id="text-2">
<p>
Just to give you a feel for the level of detail I'm providing.
</p>

<blockquote>
<p>
Removed a lot of duplication - nice job                                                                                     
But retains the combinatorial explosion issue 
Also not tested/testable as far as I can tell
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> FAQ</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> What if they have no tests?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Does not affect the grade - tests are not required, just a good idea.  Note it in the feedback.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> What if they broke up the code but everything is still in 1 file?</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Well&#x2026;in terms of 1 file seems pretty unlikely to me you could do a significant refactoring to the code while just keeping in the same file.  So yeah, probably lose some points - maybe 25% if the file is greatly broken up and cleaner, and 50% if it's just a cursory job.
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> What if the code no longer works?</h3>
<div class="outline-text-3" id="text-3-3">
<p>
If the code doesn't work - I'd say it depends a bit.  If it looks like a small bug, take off a couple points for not testing.  If the could could never have worked/is deeply wrong then take off more (maybe 50%).
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Where should feedback be placed?</h3>
<div class="outline-text-3" id="text-3-4">
<p>
In the comments field in Moodle.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2015-03-18 Wed 13:33</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
